cases/caseB/system/forces
/*--------------------------------*- C++ -*----------------------------------*\
| OpenFOAM-12  propeller MRF case  (generated by scripts/gen_case.py)          |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      forces;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type        forces;
libs        ("libforces.so");
patches     (propeller);

rho         rhoInf;
rhoInf      1.225;

CofR        (0 0 0);
writeControl timeStep;
writeInterval 50;
log         yes;
