cases/caseB/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| OpenFOAM-12  propeller MRF case  (generated by scripts/gen_case.py)          |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

castellatedMesh true;
snap            true;
addLayers       false;

geometry
{
    propeller
    {
        type triSurfaceMesh;
        file "propeller.stl";
    }
    rotorRegion
    {
        type   searchableCylinder;
        point1 (0 0 -0.035);
        point2 (0 0 0.035);
        radius 0.056;
    }
};

castellatedMeshControls
{
    maxLocalCells       2000000;
    maxGlobalCells      6000000;
    minRefinementCells  10;
    nCellsBetweenLevels 3;
    maxLoadUnbalance    0.10;
    resolveFeatureAngle 30;
    allowFreeStandingZoneFaces true;

    features
    (
        { file "propeller.eMesh"; level 3; }
    );

    refinementSurfaces
    {
        propeller
        {
            level (3 3);
            patchInfo { type wall; }
        }
    }

    refinementRegions
    {
        rotorRegion
        {
            mode   inside;
            levels ((2 2));
        }
    }

    locationInMesh (0.0 0.0 0.27999999999999997);
}

snapControls
{
    nSmoothPatch     3;
    tolerance        2.0;
    nSolveIter       50;
    nRelaxIter       5;
    nFeatureSnapIter 10;
    implicitFeatureSnap     false;
    explicitFeatureSnap     true;
    multiRegionFeatureSnap  false;
}

addLayersControls
{
    relativeSizes       true;
    expansionRatio      1.2;
    finalLayerThickness 0.4;
    minThickness        0.1;
    nGrow               0;
    featureAngle        60;
    nRelaxIter          3;
    nSmoothSurfaceNormals 1;
    nSmoothNormals      3;
    nSmoothThickness    10;
    maxFaceThicknessRatio 0.5;
    maxThicknessToMedialRatio 0.3;
    minMedianAxisAngle  90;
    nBufferCellsNoExtrude 0;
    nLayerIter          50;
    layers { propeller { nSurfaceLayers 3; } }
}

meshQualityControls
{
    maxNonOrtho         65;
    maxBoundarySkewness 20;
    maxInternalSkewness 4;
    maxConcave          80;
    minVol              1e-13;
    minTetQuality       1e-15;
    minArea             -1;
    minTwist            0.02;
    minDeterminant      0.001;
    minFaceWeight       0.05;
    minVolRatio         0.01;
    minTriangleTwist    -1;
    nSmoothScale        4;
    errorReduction      0.75;
}

mergeTolerance 1e-6;
